import React from 'react'

const Manual: React.FC = () => {

    return (
        <div className=''>

            <h5>Игра «Кто Я?»</h5>

            Простая и веселая игра на внимательность «Угадай персонажа» – это отличная забава для дружеских посиделок.
            Включите свое шестое чувство и отгадайте своего персонажа!

            <h5>Описание</h5>

            Развлечение подходит для компании взрослых или детей от 2 человек.
            Каждому игроку загадывают имя героя книги, фильма или мультсериала.
            <br />
            Задавая наводящие вопросы другим игрокам, нужно отгадать указанный образ.

            <h5>Процесс</h5>

            Кадый игрок загадывает имя героя своему соседу.
            <br />
            Собравшиеся по очереди задают вопросы по поводу внешности, характера и других отличительных черт задуманной личности.
            <br />
            На вопросы нужно отвечать односложно: только «да» или «нет».
            Если получен утвердительный ответ, игрок имеет право продолжать расспросы.
            Это может продолжаться до тех пор, пока угадывающий не услышит «нет».
            <br />
            Следует заранее договориться о том, какое количество вопросов можно задать за один ход.
            После того как первый участник получил отрицательный ответ, игру продолжает следующий.
            Для новичков можно упростить правила, выбрав перед началом игры какой-либо фильм или мультсериал, хорошо известный каждому в группе.

            <h5>Окончание игры</h5>

            Партия заканчивается, когда кто-нибудь из игроков угадал имя своего персонажа.
            Далее борьба может быть продолжена за звание призера второго и третьего места.
            <br />
            Можно провести серию туров, по результатам которой определится победитель – тот, кто чаще других узнавал задуманного персонажа.
            <br />
            Проверьте свой кругозор и логику в веселой компании!

        </div>
    )
}

export default Manual

/*Каждый из участников (их может быть от 2-х до бесконечности) загадывает своему соседу имя любого культурного деятеля, исторического лица, персонажа любого художественного произведения или же какого-то локального деятеля, но обязательно известного всем участвующим в игре.
                После того, как вся подготовка окончена, всем загадали героев, начинается игра.
                Первым делом каждый должен ознакомиться с «ролями» своих коллег, чтобы с легкостью продолжать игру.
                Итак, когда все всё узнали и поняли, можно приступать к самой интересной части – вопросам.
                Выбирается человек, с которого будет начинаться круг: здесь нет определенного принципа.
                Вопрос нужно конструировать так, чтобы на него можно было ответить только «да» или «нет».
                Например, первый вопрос часто бывает подобного типа: «Я реально существующий персонаж?»
                И вся компания отвечает этому человеку: «Да» или «Нет». Отвечают обычно хором, поэтому если кто-то один или несколько людей не знает ответ на какой-то вопрос, ничего страшного не происходит.
                Итак, если человеку на его вопрос ответили «Да», он может продолжать расспрос, задавая следующий вопрос. Один человек играет до тех пор, пока на его вопрос не ответят «нет» или пока он не скажет «пасс». Взять «пасс» можно в том случае, если у вас нет подходящих вопросов или вы хотите обдумать ту информацию, которую вам уже дали.
                Каждый из игроков задает наводящие вопросы всей команде до тех пор, пока кто-то один не угадает, кем он на самом деле является.
                Например, человек, получив достаточную информацию и все обдумав, спрашивает «Я – Лермонтов?». Если ему отвечают «да», значит, он победил и он выходит из игры, но у него остается право отвечать на вопросы своих коллег. Если он ошибся, не угадал и ему ответили «нет», он продолжает игру вместе со всеми.
                Выдвигать конкретные предположения по поводу того, какую роль вам загадали, можно не больше трех раз. Если на третий раз вам ответили «нет», вы в качестве наказания пропускаете свой следующий ход.
                Когда остаются двое игроков, они соревнуются до тех пор, пока кто-то один не угадает своего героя. Тогда оставшемуся игроку дают три хода – то есть три раза ему могут ответить «нет», после третьего он считается проигравшим.*/